Revit 2027 API
AssetPropertyDoubleMatrix44 Properties
The AssetPropertyDoubleMatrix44 type exposes the following members.
Properties
Name | Description
IsReadOnly |  Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
(Inherited from AssetProperty)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AssetProperty)
Name | Get the name of the AssetProperty
(Inherited from AssetProperty)
NumberOfConnectedProperties |  The number of currently connected properties.
(Inherited from AssetProperty)
Type | Returns the type of the AssetProperty
(Inherited from AssetProperty)
Value | Get the value of the property
Top
See Also
Reference
AssetPropertyDoubleMatrix44 Class
Autodesk.Revit.DB.Visual Namespace